Feature: Перегляд типів танців
As a клієнтка цього додатку
I want to була можливість детальніше дізнатися вимоги до фізичного стану танцівниці
In order to  мати можливість збереження свого фізичного стану в безпеці

Scenario 1: при заходженні в додаток  пропонуються категорії танців за інтенсивністю
Given клієнтка вибирає певну категорію
And обирає якись конкретний танок
When клієнтка тільки зайшла в додаток
Then клієнтка має змогу заздалегідь розраховувати на певне навантаження

Scenario 2: При реєстрації клієнтка запомнює анкету про свій вік, фізичний стан і захворювання
Given клієнтка обирає певні захворювання чи їх  відсутність, вік 
And  бажання з якою інтенсивністю займатися
When  реєструється
Then клієнтка має змогу бачити тільки ті танці, які безпечні для її здоров'я
