Feature: Перегляд переліку страв
As a клієнтка цього онлайн-ресторану
I want to була можливість детальніше дізнатися інформацію про страву 
In order to  мати можливість швидко зробити підходяще замовлення

Scenario 1: при заходженні на сайт мені пропонуються категорії страв
Given клієнтка вибирає певну категорію
And обирає якусь конкретну страву
When клієнтка знаходиться на сторінці зі стравою
Then клієнтка має змогу бачити інгредієнти страв і нижче страви зі схожими характеристиками.

Scenario 2: страви можна вибирати за певними фільтрами
Given клієнтка обирає певні фільтри присутності інгредієнтів
And клієнтка обирає певні фільтри відсутності інгредієнтів
When коли вибрала категорію страв
Then клієнтка має змогу бачити тільки ті страви, які відповідают фільтрам(її вимогам)
