Feature: Перегляд інформації про танці
As a клієнтка цього додатку
I want to була можливість детальніше дізнатися історичну інформацію про танці
In order to  мати можливість збагачувати свої знання щодо цього напряму

Scenario 1: при переходженні на сторінку з танцем буде кнопка, за допомогою якої користувачку буде перенесено на відповідну сторінку 
Given клієнтка вибирає певний танець
And і натискає кнопку "додаткова інформація"
When знаходиться на сторінці конкретного танцю 
Then клієнтка має змогу дізнатися інформацію про цей танок

Scenario 2: При заходженні в додаток, при наведені мишею на категорію танців(за країною походження) буде висвічена загальна інформація про танці цієї країни
Given клієнтка заходить у додаток
And  наводить курсор на певну картинку з назвою країни
When  знаходить на головній сторінці
Then клієнтка має змогу бачити загальну історичну інформацію про танки цієї країни
